### Look into "What are the payment methods preferred by social drinkers?"

from: https://dev-10.teachable.com/courses/data-engineering-c50/lectures/45590968

In [4]:
import pandas as pd
import os, sys
from IPython.display import display

### Load in all the csv's, explore the fields and shape for each

Use one dictionary , `dfs` so we don't need separate variable names for each df, but can still reference each one based off the filename we loaded it in from.

In [3]:
data_dir = '../data/restaurants/'
os.listdir(data_dir)
dfs = {}
for fn in os.listdir(data_dir):
    if fn.lower().endswith('.csv'):
        df_name = fn.split('.')[0]
        dfs[df_name] = pd.read_csv(os.path.join(data_dir, fn))

In [33]:
for k,v in dfs.items():
    print(k, v.shape)
    display(v.head(2))

chefmozaccepts (1314, 2)

   placeID Rpayment
0   135110     cash
1   135110     VISA

chefmozcuisine (916, 2)

   placeID Rcuisine
0   135110  Spanish
1   135109  Italian

chefmozhours4 (2339, 3)

   placeID         hours                  days
0   135111  00:00-23:30;  Mon;Tue;Wed;Thu;Fri;
1   135111  00:00-23:30;                  Sat;

chefmozparking (702, 2)

   placeID parking_lot
0   135111      public
1   135110        none

geoplaces2 (130, 21)

,placeID,latitude,longitude,the_geom_meter,name,address,city,state,country,fax,...,alcohol,smoking_area,dress_code,accessibility,price,url,Rambience,franchise,area,other_services
0,134999,18.915421,-99.184871,0101000020957F000088568DE356715AC138C0A525FC46...,Kiku Cuernavaca,Revolucion,Cuernavaca,Morelos,Mexico,?,...,No_Alcohol_Served,none,informal,no_accessibility,medium,kikucuernavaca.com.mx,familiar,f,closed,none
1,132825,22.147392,-100.983092,0101000020957F00001AD016568C4858C1243261274BA5...,puesto de tacos,esquina santos degollado y leon guzman,s.l.p.,s.l.p.,mexico,?,...,No_Alcohol_Served,none,informal,completely,low,?,familiar,f,open,none

rating_final (1161, 5)

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1

usercuisine (330, 2)

  userID  Rcuisine
0  U1001  American
1  U1002   Mexican

userpayment (177, 2)

  userID Upayment
0  U1001     cash
1  U1002     cash

userprofile (138, 19)

,userID,latitude,longitude,smoker,drink_level,dress_preference,ambience,transport,marital_status,hijos,birth_year,interest,personality,religion,activity,color,weight,budget,height
0,U1001,22.139997,-100.978803,false,abstemious,informal,family,on foot,single,independent,1989,variety,thrifty-protector,none,student,black,69,medium,1.77
1,U1002,22.150087,-100.983325,false,abstemious,informal,family,public,single,independent,1990,technology,hunter-ostentatious,Catholic,student,red,40,low,1.87

In [34]:
# Since we need to connect "social drinkers" to "payment method" 
# we'll need separate df's, see next section
[(k, v.columns) for k,v in dfs.items()]

[('chefmozaccepts', Index(['placeID', 'Rpayment'], dtype='object')),
 ('chefmozcuisine', Index(['placeID', 'Rcuisine'], dtype='object')),
 ('chefmozhours4', Index(['placeID', 'hours', 'days'], dtype='object')),
 ('chefmozparking', Index(['placeID', 'parking_lot'], dtype='object')),
 ('geoplaces2',
  Index(['placeID', 'latitude', 'longitude', 'the_geom_meter', 'name', 'address',
         'city', 'state', 'country', 'fax', 'zip', 'alcohol', 'smoking_area',
         'dress_code', 'accessibility', 'price', 'url', 'Rambience', 'franchise',
         'area', 'other_services'],
        dtype='object')),
 ('rating_final',
  Index(['userID', 'placeID', 'rating', 'food_rating', 'service_rating'], dtype='object')),
 ('usercuisine', Index(['userID', 'Rcuisine'], dtype='object')),
 ('userpayment', Index(['userID', 'Upayment'], dtype='object')),
 ('userprofile',
  Index(['userID', 'latitude', 'longitude', 'smoker', 'drink_level',
         'dress_preference', 'ambience', 'transport', 'marital_status', 'hijos',
         'birth_year', 'interest', 'personality', 'religion', 'activity',
         'color', 'weight', 'budget', 'height'],
        dtype='object'))]

### Select DataFrame: `userpayment`, `userprofile`

In [24]:
userpayment = dfs['userpayment']
userprofile = dfs['userprofile']

display(userpayment.head(5))
display(userprofile.head(5))

  userID          Upayment
0  U1001              cash
1  U1002              cash
2  U1003              cash
3  U1004              cash
4  U1004  bank_debit_cards

,userID,latitude,longitude,smoker,drink_level,dress_preference,ambience,transport,marital_status,hijos,birth_year,interest,personality,religion,activity,color,weight,budget,height
0,U1001,22.139997,-100.978803,false,abstemious,informal,family,on foot,single,independent,1989,variety,thrifty-protector,none,student,black,69,medium,1.77
1,U1002,22.150087,-100.983325,false,abstemious,informal,family,public,single,independent,1990,technology,hunter-ostentatious,Catholic,student,red,40,low,1.87
2,U1003,22.119847,-100.946527,false,social drinker,formal,family,public,single,independent,1989,none,hard-worker,Catholic,student,blue,60,low,1.69
3,U1004,18.867000,-99.183000,false,abstemious,informal,family,public,single,independent,1940,variety,hard-worker,none,professional,green,44,medium,1.53
4,U1005,22.183477,-100.959891,false,abstemious,no preference,family,public,single,independent,1992,none,thrifty-protector,Catholic,student,black,65,medium,1.69

In [32]:
# get userID's of user registered as social drinkers
vc_drinks = userprofile['drink_level'].value_counts()
is_social = vc_drinks.index[2]
vc_drinks

abstemious        51
casual drinker    47
social drinker    40
Name: drink_level, dtype: int64

In [31]:
ind = userprofile['drink_level'] == is_social
social_drinkers = userprofile[ind][['userID']]
print(len(social_drinkers))
social_drinkers.head(3)

40

  userID
2  U1003
5  U1006
7  U1008

### Check shape and uniqueness of userID's

They are all unique in `userprofile` but they are repeated in `userpayment` meaning this table acts like the many side of a one-to-many of `userprofile(userID) -> userpayment(userID)`

ETL:
 - load csv
 - transform obj -> int64
 - load into matplotlib

In [28]:
len(social_drinkers['userID'].unique()), social_drinkers.shape

(40, (40, 1))

In [30]:
len(userpayment['userID'].unique()), userpayment.shape

(133, (177, 2))

### Perform the merge

In [35]:
len(social_drinkers), len(userpayment)

(40, 177)

In [36]:
both = pd.merge(social_drinkers, userpayment, how='inner', on='userID')

In [37]:
len(both)

56

In [40]:
both

   userID             Upayment
0   U1003                 cash
1   U1006                 cash
2   U1008                 cash
3   U1010                 cash
4   U1015                 cash
5   U1021                 cash
6   U1027                 cash
7   U1033                 cash
8   U1036                 cash
9   U1037                 cash
10  U1038                 cash
11  U1039                 cash
12  U1044                 VISA
13  U1044     bank_debit_cards
14  U1044                 cash
15  U1044  MasterCard-Eurocard
16  U1046                 cash
17  U1050                 cash
18  U1052                 cash
19  U1054                 cash
20  U1056                 cash
21  U1061                 cash
22  U1061     bank_debit_cards
23  U1069  MasterCard-Eurocard
24  U1069                 cash
25  U1076                 VISA
26  U1076                 cash
27  U1076     bank_debit_cards
28  U1077                 VISA
29  U1077                 cash
30  U1077     bank_debit_cards
31  U1078                 VISA
32  U1078     bank_debit_cards
33  U1078                 cash
34  U1080                 cash
35  U1086                 VISA
36  U1086     bank_debit_cards
37  U1086                 cash
38  U1090                 cash
39  U1098                 cash
40  U1099                 cash
41  U1099                 VISA
42  U1102                 cash
43  U1104                 VISA
44  U1104                 cash
45  U1105                 cash
46  U1115                 cash
47  U1116                 cash
48  U1116     bank_debit_cards
49  U1116                 VISA
50  U1121                 cash
51  U1121     bank_debit_cards
52  U1131                 cash
53  U1136                 cash
54  U1137                 cash
55  U1138                 cash

In [39]:
both['Upayment'].value_counts()

cash                   38
VISA                    8
bank_debit_cards        8
MasterCard-Eurocard     2
Name: Upayment, dtype: int64

In [ ]:
# So for social drinkers,
# 38 use cash, followed by 8 for visa.

In [41]:
# compared to all users
userpayment['Upayment'].value_counts()

cash                   131
bank_debit_cards        22
VISA                    17
MasterCard-Eurocard      4
American_Express         3
Name: Upayment, dtype: int64